# PANDAS - PANnel DAtaSets

In [1]:
import numpy as np
import pandas as pd

In [3]:
odi_ranking = pd.read_clipboard()

In [4]:
odi_ranking

   2        AB de Villiers    SA  844
0   3         David Warner   AUS  823
1   4             Joe Root   ENG  814
2   5           Babar Azam   PAK  813
3   6         Rohit Sharma   IND  799
4   7          Ross Taylor    NZ  785
5   8      Quinton de Kock    SA  783
6   9  Francois du Plessis    SA  782
7  10      Kane Williamson    NZ  778
8  11       Shikhar Dhawan   IND  769

# Reading EXCEL file

In [5]:
dataset = pd.read_excel('dataset.xlsx')
dataset

        Name   Age Designation     Salary
0   Srikanth  27.0          DS        NaN
1     Sahiti  20.0          CS   100000.0
2  Surya Tej  25.0          DS    50000.0
3    Rishika  19.0     Manager   200000.0
4     Sravya   NaN         CEO  1000000.0

In [6]:
dataset.keys()

Index(['Name', 'Age', 'Designation', 'Salary'], dtype='object')

In [7]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Name           5 non-null object
Age            4 non-null float64
Designation    5 non-null object
Salary         4 non-null float64
dtypes: float64(2), object(2)
memory usage: 240.0+ bytes

# Extracting Names

In [8]:
dataset['Name']

0     Srikanth
1       Sahiti
2    Surya Tej
3      Rishika
4       Sravya
Name: Name, dtype: object

# Extracting Salaries

In [9]:
dataset['Salary']
# NaN -> Not a number

0          NaN
1     100000.0
2      50000.0
3     200000.0
4    1000000.0
Name: Salary, dtype: float64

In [10]:
list_col = ['Name','Age']
dataset[list_col]

        Name   Age
0   Srikanth  27.0
1     Sahiti  20.0
2  Surya Tej  25.0
3    Rishika  19.0
4     Sravya   NaN

# Designation and Salary

In [11]:
dataset[['Designation', 'Salary']]

  Designation     Salary
0          DS        NaN
1          CS   100000.0
2          DS    50000.0
3     Manager   200000.0
4         CEO  1000000.0

### Find the name of the person whos salary is greater than  or equal 1,00,000

In [14]:
cond = dataset['Salary'] >= 100000

In [18]:
dataset[cond]['Name']

1     Sahiti
3    Rishika
4     Sravya
Name: Name, dtype: object